"""
config.py
Все параметры, начальные условия и дефолтные настройки интерфейса.
"""

# Настройки по умолчанию для TRS и временной шкалы
DEFAULT_SIM_CONFIG = {
    "h": 0.01,
    "N_iterations": 300,
    "t_start": 245.0,
    "dt": 1.0,
    "t_max": 300.0,
    "K_x_fwd": 5.0,
    "K_y_fwd": 0.0,
    "K_z_fwd": 0.0,
    "K_x_bwd": 5.0,
    "K_y_bwd": 0.0,
    "K_z_bwd": 0.0,
    # Параметры фазового портрета
    "decimator": 10,
    "t_transient": 50.0,
    "t_attractor": 250.0,
    "portrait_iters": 50,
}

# Словарь настроек для систем
SYSTEMS_CONFIG = {
    "Sprott B": {
        "params": {
            "a1": 0.5,
            "a2": 1.6,
            "a3": -1.5,
            "a4": 1.0,
            "a5": -1.0,
        },
        "master_0": (0.1, 0.1, 0.1),
        "slave_0": (5.0, 2.0, 0.0),
    },
    "Dadras Momeni": {
        "params": {
            "a1": 3.0,
            "a2": 2.7,
            "a3": 4.7,
            "a4": 2.0,
            "a5": 9.0,
            "s": 0.5,
        },
        "master_0": (0.1, 0.1, 0.1),
        "slave_0": (1.0, 1.0, 1.0),
    },
    "Lorenz": {
        "params": {
            "a1": 10.0,
            "a2": 28.0,
            "a3": 8.0/3.0,
            "s": 0.5,
        },
        "master_0": (0.1, 0.1, 0.1),
        "slave_0": (1.0, 1.0, 1.0),
    },
}